/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/6/23
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __TEST_H
#define __TEST_H

#include "Type.h"

/*测试按键1*/
#define TEST_BU1    PC_IDR_IDR4
/*测试按键2*/
#define TEST_BU2    PC_IDR_IDR5

/**********************************************函数定义***************************************************** 
* 函数名称: void TestInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/6/23
************************************************************************************************************/ 
void TestInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void TestReadBu(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/6/23
************************************************************************************************************/ 
void TestReadBu(void);

#endif


